Инвестиции_1С/src/AccumulationRegisters/ДИ_ДенежныеСредстваПортфелей/ДИ_ДенежныеСредстваПортфелей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДИ_ДенежныеСредстваПортфелей</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Портфель</name>
    <type>
      <types>CatalogRef.ДИ_Портфели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Инвестиции_1С/src/AccumulationRegisters/ДИ_ДенежныеСредстваПортфелей/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаОтрицательныхОстатков(МВТ, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Портфель КАК Портфель,
	|	Валюта КАК Валюта
	|ПОМЕСТИТЬ ВтРасходы
	|ИЗ
	|	ВтДвижения КАК Движения
	|ГДЕ
	|	ВидДвижения = &ВидДвижения
	|СГРУППИРОВАТЬ ПО
	|	Портфель,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтДвижения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтРасходы.Портфель КАК Портфель,
	|	ВтРасходы.Валюта КАК Валюта,
	|	ЕСТЬNULL(Остатки.СуммаОстаток, 0) КАК Остаток
	|ИЗ
	|	ВтРасходы КАК ВтРасходы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ДИ_ДенежныеСредстваПортфелей.Остатки(, Портфель В
	|			(ВЫБРАТЬ
	|				Портфель
	|			ИЗ
	|				ВтРасходы КАК ВтРасходы)
	|		И Валюта В
	|			(ВЫБРАТЬ
	|				Валюта
	|			ИЗ
	|				ВтРасходы КАК ВтРасходы)) КАК Остатки
	|		ПО ВтРасходы.Портфель = Остатки.Портфель
	|		И ВтРасходы.Валюта = Остатки.Валюта
	|ГДЕ
	|	ЕСТЬNULL(СуммаОстаток, 0) < 0";
	
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
	
	РезультатРасход = Запрос.Выполнить();
	
	Если РезультатРасход.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаОстатки = РезультатРасход.Выбрать();
	
	Пока ВыборкаОстатки.Следующий() Цикл
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Недостаточно денежных средств в портфеле ""%1"" в валюте ""%2"", превышен остаток на %3.'"),
			ВыборкаОстатки.Портфель,
			ВыборкаОстатки.Валюта,
			-ВыборкаОстатки.Остаток);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Отказ = Истина;
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
